### Terraform Plan
<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/use1-development-testLambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "TerraformModule" = "lambda"
        }
      + tags_all          = {
          + "TerraformModule" = "lambda"
        }
    }

  # aws_iam_policy.lambda_execution will be created
  + resource "aws_iam_policy" "lambda_execution" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "use1-development-testLambda-lambda-execution"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:us-east-1:000000000000:log-group:/aws/lambda/use1-development-testLambda*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "cloudwatch:PutMetricData"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "use1-development-testLambda-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.lambda_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_execution" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda.zip"
      + function_name                  = "use1-development-testLambda"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "TerraformModule" = "lambda"
        }
      + tags_all                       = {
          + "TerraformModule" = "lambda"
        }
      + timeout                        = 20
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "STAGE" = "development"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lambda = {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_signing_config_arn        = null
      + dead_letter_config             = []
      + description                    = null
      + environment                    = [
          + {
              + variables = {
                  + "STAGE" = "development"
                }
            },
        ]
      + ephemeral_storage              = (known after apply)
      + file_system_config             = []
      + filename                       = "lambda.zip"
      + function_name                  = "use1-development-testLambda"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + image_config                   = []
      + image_uri                      = null
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = null
      + last_modified                  = (known after apply)
      + layers                         = null
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + s3_bucket                      = null
      + s3_key                         = null
      + s3_object_version              = null
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + snap_start                     = []
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "TerraformModule" = "lambda"
        }
      + tags_all                       = {
          + "TerraformModule" = "lambda"
        }
      + timeout                        = 20
      + timeouts                       = null
      + tracing_config                 = [
          + {
              + mode = "Active"
            },
        ]
      + version                        = (known after apply)
      + vpc_config                     = []
    }

```

</details>